/*
	import {Themes} from 'future/src/lib';
	Themes.c1
*/
function themes() {
	return {
		//黑白灰色调
		"c1" : "#ffffff", //用于底部导航栏、搜索框背景、弹窗背景、按初始状态按钮等
		"c2" : "#cccccc", //可做'搜索框'文字用色
		"c3" : "#999999", //153 153 153 用于辅助性文字、不可点击按钮文字等
		"c4" : "#666666",
		"c5" : "#333333", //(51,51,51)//用于重要级文字信息、内页标题信息等
		"c6" : "#0c1828", //用于重要标题文字
		//主色调
		"c7" : "#3491df", //(52.145.223)APP界面主色调，用于特别需要强调和突出的文字、按钮(确认、同意等肯定类按钮)
		//分割线用色
		"c8" : "#e5e5e5", //用于列表1px浅灰色分割线
		//背景色
		"c9" : "#edf1f7", //用于二级分类背景
		"c10" : "#f9f9f9", //用于首页、内页背景等
		//其它
		"c11" : "#53606a", //(83.96.106)
		"c12" : "#798b9a",
		"c13" : "#8495a2", //(132,149,162)
		"c14" : "#c5cedb", //用于输入框提示文字
		"c15" : "#e82f2f", //用于订单状态等
		"c16" : "#ff8a00", //(255.138.0)用于价格、订单状态等
		"c17" : "#a1adb7", //用于商品类型、厂家等灰色文字等

		//商品列表分割线用色
		"c18" : "#eeeeee", ////用于商品列表1px浅灰色分割线
		"c19" : "#b7d4ff", //用于分类 tap 未选中状态
		"c21" : "#596875", //用于二级分类 正常状态文字颜色
		"c20" : "#81b1da", //用于筛选文字
		"c22" : "#fafafa", //用于购物车 商品项 库存项 灰色背景

		//积分
		"c23" : "#000000", //纯黑

		//退货详情提示
		"c24" : "#ffead1",

		"c25" : "#6e8393", //(110.130.147),//订单列表 操作按钮

		"c26" : "#bbbbbb", //(187,187,187),//订单列表 操作按钮

		//业务员
		"c27" : "#feeac7", //用户为业务员时顶部黄色提示
		"c28" : "#c2c2c2", //按钮禁用文字

		"c29" : "#27a5d9", //收银台弹层蓝色字体

		"c30" : "#f1f4f3", //竞价详情背景

		"c31" : "#888888", //资讯频道 咨询内容用字

		"c32" : "#16a846", //绿色

		//透明背景色
		"o1" : "#7F000000", //原来#7F000000，现在设计部要求该改为#7f7f7f
		//红色主题
		'RED' : "#fd4854",
		'SRED' : "#ff6670",
		//蓝色主题
		'BLUE' : "#0099cc",
		'SBLUE' : "#0fb2e9",
		//橙色主题

		'ORANGE' : "#ff9933",
		'SORANGE' : "#ffac5a",

		'f100' : 50,
		'f80' : 40,
		'f72' : 36,
		'f70' : 35,
		'f60' : 30,
		'f50' : 25,
		'f40' : 20,
		'f36' : 18,
		'f34' : 17,
		'f32' : 16,
		'f30' : 15,
		'f28' : 14,
		'f26' : 13,
		'f24' : 12,
		'f22' : 11,
		'f20' : 10,
		'f18' : 9,
		'f14' : 7,
	};
};

/************ 苹方字体 ************/
//粗体 fontFamily : 'PingFangSC-Medium'
//特细 fontFamily : 'PingFangSC-Ultralight'
//特粗 fontFamily : 'PingFangSC-Semibold'
//细体 fontFamily : 'PingFangSC-Thin'
//中等 fontFamily : 'PingFangSC-Regular'
//常规 fontFamily : 'PingFangSC-Light'

//加粗 fontWeight : "bold"
var imall_themes = themes();

module.exports = imall_themes;
